MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS610/mcu.h
#define ADCPC2 ADCPC2
extern volatile uint16_t ADCPC2 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC2BITS {
  union {
    struct {
      uint16_t TRGSRC4:5;
      uint16_t SWTRG4:1;
      uint16_t PEND4:1;
      uint16_t IRQEN4:1;
      uint16_t TRGSRC5:5;
      uint16_t SWTRG5:1;
      uint16_t PEND5:1;
      uint16_t IRQEN5:1;
    };
    struct {
      uint16_t TRGSRC40:1;
      uint16_t TRGSRC41:1;
      uint16_t TRGSRC42:1;
      uint16_t TRGSRC43:1;
      uint16_t TRGSRC44:1;
      uint16_t :3;
      uint16_t TRGSRC50:1;
      uint16_t TRGSRC51:1;
      uint16_t TRGSRC52:1;
      uint16_t TRGSRC53:1;
      uint16_t TRGSRC54:1;
    };
  };
} ADCPC2BITS;
extern volatile ADCPC2BITS ADCPC2bits __attribute__((__sfr__));

#define ADCPC3 ADCPC3
extern volatile uint16_t ADCPC3 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC3BITS {
  union {
    struct {
      uint16_t TRGSRC6:5;
      uint16_t SWTRG6:1;
      uint16_t PEND6:1;
      uint16_t IRQEN6:1;
      uint16_t TRGSRC7:5;
      uint16_t SWTRG7:1;
      uint16_t PEND7:1;
      uint16_t IRQEN7:1;
    };
    struct {
      uint16_t TRGSRC60:1;
      uint16_t TRGSRC61:1;
      uint16_t TRGSRC62:1;
      uint16_t TRGSRC63:1;
      uint16_t TRGSRC64:1;
      uint16_t :3;
      uint16_t TRGSRC70:1;
      uint16_t TRGSRC71:1;
      uint16_t TRGSRC72:1;
      uint16_t TRGSRC73:1;
      uint16_t TRGSRC74:1;
    };
  };
} ADCPC3BITS;
extern volatile ADCPC3BITS ADCPC3bits __attribute__((__sfr__));

#define ADCPC4 ADCPC4
extern volatile uint16_t ADCPC4 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC4BITS {
  union {
    struct {
      uint16_t TRGSRC8:5;
      uint16_t SWTRG8:1;
      uint16_t PEND8:1;
      uint16_t IRQEN8:1;
      uint16_t TRGSRC9:5;
      uint16_t SWTRG9:1;
      uint16_t PEND9:1;
      uint16_t IRQEN9:1;
    };
    struct {
      uint16_t TRGSRC80:1;
      uint16_t TRGSRC81:1;
      uint16_t TRGSRC82:1;
      uint16_t TRGSRC83:1;
      uint16_t TRGSRC84:1;
      uint16_t :3;
      uint16_t TRGSRC90:1;
      uint16_t TRGSRC91:1;
      uint16_t TRGSRC92:1;
      uint16_t TRGSRC93:1;
      uint16_t TRGSRC94:1;
    };
  };
} ADCPC4BITS;
extern volatile ADCPC4BITS ADCPC4bits __attribute__((__sfr__));

#define ADCPC5 ADCPC5
extern volatile uint16_t ADCPC5 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC5BITS {
  union {
    struct {
      uint16_t TRGSRC10:5;
      uint16_t SWTRG10:1;
      uint16_t PEND10:1;
      uint16_t IRQEN10:1;
      uint16_t TRGSRC11:5;
      uint16_t SWTRG11:1;
      uint16_t PEND11:1;
      uint16_t IRQEN11:1;
    };
    struct {
      uint16_t TRGSRC100:1;
      uint16_t TRGSRC101:1;
      uint16_t TRGSRC102:1;
      uint16_t TRGSRC103:1;
      uint16_t TRGSRC104:1;
      uint16_t :3;
      uint16_t TRGSRC110:1;
      uint16_t TRGSRC111:1;
      uint16_t TRGSRC112:1;
      uint16_t TRGSRC113:1;
      uint16_t TRGSRC114:1;
    };
  };
} ADCPC5BITS;
extern volatile ADCPC5BITS ADCPC5bits __attribute__((__sfr__));

#define ADCPC6 ADCPC6
extern volatile uint16_t ADCPC6 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC6BITS {
  union {
    struct {
      uint16_t TRGSRC12:5;
      uint16_t SWTRG12:1;
      uint16_t PEND12:1;
      uint16_t IRQEN12:1;
    };
    struct {
      uint16_t TRGSRC120:1;
      uint16_t TRGSRC121:1;
      uint16_t TRGSRC122:1;
      uint16_t TRGSRC123:1;
      uint16_t TRGSRC124:1;
    };
  };
} ADCPC6BITS;
extern volatile ADCPC6BITS ADCPC6bits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile uint16_t ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t ADCBUF14 __attribute__((__sfr__));
#define ADCBUF15 ADCBUF15
extern volatile uint16_t ADCBUF15 __attribute__((__sfr__));
#define ADCBUF16 ADCBUF16
extern volatile uint16_t ADCBUF16 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile uint16_t ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile uint16_t ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile uint16_t ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile uint16_t ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile uint16_t ADCBUF21 __attribute__((__sfr__));
#define ADCBUF22 ADCBUF22
extern volatile uint16_t ADCBUF22 __attribute__((__sfr__));
#define ADCBUF23 ADCBUF23
extern volatile uint16_t ADCBUF23 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile uint16_t ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile uint16_t ADCBUF25 __attribute__((__sfr__));
#define DMA0CON DMA0CON
extern volatile uint16_t DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA0CONBITS;
