MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS610/mcu.h
/* ADSTAT */
#define _P0RDY ADSTATbits.P0RDY
#define _P1RDY ADSTATbits.P1RDY
#define _P2RDY ADSTATbits.P2RDY
#define _P3RDY ADSTATbits.P3RDY
#define _P4RDY ADSTATbits.P4RDY
#define _P5RDY ADSTATbits.P5RDY
#define _P6RDY ADSTATbits.P6RDY
#define _P7RDY ADSTATbits.P7RDY
#define _P8RDY ADSTATbits.P8RDY
#define _P9RDY ADSTATbits.P9RDY
#define _P10RDY ADSTATbits.P10RDY
#define _P11RDY ADSTATbits.P11RDY
#define _P12RDY ADSTATbits.P12RDY

/* ADCPC0 */
#define _TRGSRC0 ADCPC0bits.TRGSRC0
#define _SWTRG0 ADCPC0bits.SWTRG0
#define _PEND0 ADCPC0bits.PEND0
#define _IRQEN0 ADCPC0bits.IRQEN0
#define _TRGSRC1 ADCPC0bits.TRGSRC1
#define _SWTRG1 ADCPC0bits.SWTRG1
#define _PEND1 ADCPC0bits.PEND1
#define _IRQEN1 ADCPC0bits.IRQEN1
#define _TRGSRC00 ADCPC0bits.TRGSRC00
#define _TRGSRC01 ADCPC0bits.TRGSRC01
#define _TRGSRC02 ADCPC0bits.TRGSRC02
#define _TRGSRC03 ADCPC0bits.TRGSRC03
#define _TRGSRC04 ADCPC0bits.TRGSRC04
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
#define _TRGSRC13 ADCPC0bits.TRGSRC13
#define _TRGSRC14 ADCPC0bits.TRGSRC14

/* ADCPC1 */
#define _TRGSRC2 ADCPC1bits.TRGSRC2
#define _SWTRG2 ADCPC1bits.SWTRG2
#define _PEND2 ADCPC1bits.PEND2
#define _IRQEN2 ADCPC1bits.IRQEN2
#define _TRGSRC3 ADCPC1bits.TRGSRC3
#define _SWTRG3 ADCPC1bits.SWTRG3
#define _PEND3 ADCPC1bits.PEND3
#define _IRQEN3 ADCPC1bits.IRQEN3
#define _TRGSRC20 ADCPC1bits.TRGSRC20
#define _TRGSRC21 ADCPC1bits.TRGSRC21
#define _TRGSRC22 ADCPC1bits.TRGSRC22
#define _TRGSRC23 ADCPC1bits.TRGSRC23
#define _TRGSRC24 ADCPC1bits.TRGSRC24
#define _TRGSRC30 ADCPC1bits.TRGSRC30
#define _TRGSRC31 ADCPC1bits.TRGSRC31
#define _TRGSRC32 ADCPC1bits.TRGSRC32
#define _TRGSRC33 ADCPC1bits.TRGSRC33
#define _TRGSRC34 ADCPC1bits.TRGSRC34

/* ADCPC2 */
#define _TRGSRC4 ADCPC2bits.TRGSRC4
#define _SWTRG4 ADCPC2bits.SWTRG4
#define _PEND4 ADCPC2bits.PEND4
#define _IRQEN4 ADCPC2bits.IRQEN4
#define _TRGSRC5 ADCPC2bits.TRGSRC5
#define _SWTRG5 ADCPC2bits.SWTRG5
#define _PEND5 ADCPC2bits.PEND5
#define _IRQEN5 ADCPC2bits.IRQEN5
#define _TRGSRC40 ADCPC2bits.TRGSRC40
#define _TRGSRC41 ADCPC2bits.TRGSRC41
#define _TRGSRC42 ADCPC2bits.TRGSRC42
#define _TRGSRC43 ADCPC2bits.TRGSRC43
#define _TRGSRC44 ADCPC2bits.TRGSRC44
#define _TRGSRC50 ADCPC2bits.TRGSRC50
#define _TRGSRC51 ADCPC2bits.TRGSRC51
#define _TRGSRC52 ADCPC2bits.TRGSRC52
#define _TRGSRC53 ADCPC2bits.TRGSRC53
#define _TRGSRC54 ADCPC2bits.TRGSRC54

/* ADCPC3 */
#define _TRGSRC6 ADCPC3bits.TRGSRC6
#define _SWTRG6 ADCPC3bits.SWTRG6
#define _PEND6 ADCPC3bits.PEND6
#define _IRQEN6 ADCPC3bits.IRQEN6
#define _TRGSRC7 ADCPC3bits.TRGSRC7
#define _SWTRG7 ADCPC3bits.SWTRG7
#define _PEND7 ADCPC3bits.PEND7
#define _IRQEN7 ADCPC3bits.IRQEN7
#define _TRGSRC60 ADCPC3bits.TRGSRC60
#define _TRGSRC61 ADCPC3bits.TRGSRC61
#define _TRGSRC62 ADCPC3bits.TRGSRC62
#define _TRGSRC63 ADCPC3bits.TRGSRC63
#define _TRGSRC64 ADCPC3bits.TRGSRC64
#define _TRGSRC70 ADCPC3bits.TRGSRC70
#define _TRGSRC71 ADCPC3bits.TRGSRC71
#define _TRGSRC72 ADCPC3bits.TRGSRC72
#define _TRGSRC73 ADCPC3bits.TRGSRC73
#define _TRGSRC74 ADCPC3bits.TRGSRC74

/* ADCPC4 */
#define _TRGSRC8 ADCPC4bits.TRGSRC8
#define _SWTRG8 ADCPC4bits.SWTRG8
#define _PEND8 ADCPC4bits.PEND8
#define _IRQEN8 ADCPC4bits.IRQEN8
#define _TRGSRC9 ADCPC4bits.TRGSRC9
#define _SWTRG9 ADCPC4bits.SWTRG9
#define _PEND9 ADCPC4bits.PEND9
#define _IRQEN9 ADCPC4bits.IRQEN9
#define _TRGSRC80 ADCPC4bits.TRGSRC80
#define _TRGSRC81 ADCPC4bits.TRGSRC81
#define _TRGSRC82 ADCPC4bits.TRGSRC82
#define _TRGSRC83 ADCPC4bits.TRGSRC83
#define _TRGSRC84 ADCPC4bits.TRGSRC84
#define _TRGSRC90 ADCPC4bits.TRGSRC90
#define _TRGSRC91 ADCPC4bits.TRGSRC91
#define _TRGSRC92 ADCPC4bits.TRGSRC92
#define _TRGSRC93 ADCPC4bits.TRGSRC93
#define _TRGSRC94 ADCPC4bits.TRGSRC94

/* ADCPC5 */
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
#define _SWTRG10 ADCPC5bits.SWTRG10
#define _PEND10 ADCPC5bits.PEND10
#define _IRQEN10 ADCPC5bits.IRQEN10
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
#define _SWTRG11 ADCPC5bits.SWTRG11
#define _PEND11 ADCPC5bits.PEND11
#define _IRQEN11 ADCPC5bits.IRQEN11
#define _TRGSRC100 ADCPC5bits.TRGSRC100
#define _TRGSRC101 ADCPC5bits.TRGSRC101
#define _TRGSRC102 ADCPC5bits.TRGSRC102
#define _TRGSRC103 ADCPC5bits.TRGSRC103
#define _TRGSRC104 ADCPC5bits.TRGSRC104
#define _TRGSRC110 ADCPC5bits.TRGSRC110
#define _TRGSRC111 ADCPC5bits.TRGSRC111
#define _TRGSRC112 ADCPC5bits.TRGSRC112
#define _TRGSRC113 ADCPC5bits.TRGSRC113
#define _TRGSRC114 ADCPC5bits.TRGSRC114

/* ADCPC6 */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
#define _SWTRG12 ADCPC6bits.SWTRG12
#define _PEND12 ADCPC6bits.PEND12
#define _IRQEN12 ADCPC6bits.IRQEN12
#define _TRGSRC120 ADCPC6bits.TRGSRC120
#define _TRGSRC121 ADCPC6bits.TRGSRC121
#define _TRGSRC122 ADCPC6bits.TRGSRC122
#define _TRGSRC123 ADCPC6bits.TRGSRC123
#define _TRGSRC124 ADCPC6bits.TRGSRC124

/* DMA0CON */
#define _MODE DMA0CONbits.MODE
#define _AMODE DMA0CONbits.AMODE
#define _NULLW DMA0CONbits.NULLW
#define _HALF DMA0CONbits.HALF
#define _DIR DMA0CONbits.DIR
#define _SIZE DMA0CONbits.SIZE
#define _CHEN DMA0CONbits.CHEN
#define _MODE0 DMA0CONbits.MODE0
#define _MODE1 DMA0CONbits.MODE1
#define _AMODE0 DMA0CONbits.AMODE0
#define _AMODE1 DMA0CONbits.AMODE1

/* DMA0REQ */
#define _IRQSEL DMA0REQbits.IRQSEL
#define _FORCE DMA0REQbits.FORCE
#define _IRQSEL0 DMA0REQbits.IRQSEL0
#define _IRQSEL1 DMA0REQbits.IRQSEL1
#define _IRQSEL2 DMA0REQbits.IRQSEL2
#define _IRQSEL3 DMA0REQbits.IRQSEL3
#define _IRQSEL4 DMA0REQbits.IRQSEL4
#define _IRQSEL5 DMA0REQbits.IRQSEL5
#define _IRQSEL6 DMA0REQbits.IRQSEL6

/* DMA1CON */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE cannot be defined because it is used by more than one SFR */
/* Bitname _NULLW cannot be defined because it is used by more than one SFR */
/* Bitname _HALF cannot be defined because it is used by more than one SFR */
/* Bitname _DIR cannot be defined because it is used by more than one SFR */
/* Bitname _SIZE cannot be defined because it is used by more than one SFR */
/* Bitname _CHEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE1 cannot be defined because it is used by more than one SFR */

