MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS610/mcu.h
#define _LEBCON8_PHF_POSITION                    0x0000000E
#define _LEBCON8_PHF_MASK                        0x00004000
#define _LEBCON8_PHF_LENGTH                      0x00000001

#define _LEBCON8_PHR_POSITION                    0x0000000F
#define _LEBCON8_PHR_MASK                        0x00008000
#define _LEBCON8_PHR_LENGTH                      0x00000001

#define _LEBDLY8_LEB_POSITION                    0x00000003
#define _LEBDLY8_LEB_MASK                        0x00000FF8
#define _LEBDLY8_LEB_LENGTH                      0x00000009

#define _LEBDLY8_LEB0_POSITION                   0x00000003
#define _LEBDLY8_LEB0_MASK                       0x00000008
#define _LEBDLY8_LEB0_LENGTH                     0x00000001

#define _LEBDLY8_LEB1_POSITION                   0x00000004
#define _LEBDLY8_LEB1_MASK                       0x00000010
#define _LEBDLY8_LEB1_LENGTH                     0x00000001

#define _LEBDLY8_LEB2_POSITION                   0x00000005
#define _LEBDLY8_LEB2_MASK                       0x00000020
#define _LEBDLY8_LEB2_LENGTH                     0x00000001

#define _LEBDLY8_LEB3_POSITION                   0x00000006
#define _LEBDLY8_LEB3_MASK                       0x00000040
#define _LEBDLY8_LEB3_LENGTH                     0x00000001

#define _LEBDLY8_LEB4_POSITION                   0x00000007
#define _LEBDLY8_LEB4_MASK                       0x00000080
#define _LEBDLY8_LEB4_LENGTH                     0x00000001

#define _LEBDLY8_LEB5_POSITION                   0x00000008
#define _LEBDLY8_LEB5_MASK                       0x00000100
#define _LEBDLY8_LEB5_LENGTH                     0x00000001

#define _LEBDLY8_LEB6_POSITION                   0x00000009
#define _LEBDLY8_LEB6_MASK                       0x00000200
#define _LEBDLY8_LEB6_LENGTH                     0x00000001

#define _LEBDLY8_LEB7_POSITION                   0x0000000A
#define _LEBDLY8_LEB7_MASK                       0x00000400
#define _LEBDLY8_LEB7_LENGTH                     0x00000001

#define _LEBDLY8_LEB8_POSITION                   0x0000000B
#define _LEBDLY8_LEB8_MASK                       0x00000800
#define _LEBDLY8_LEB8_LENGTH                     0x00000001

#define _AUXCON8_CHOPLEN_POSITION                0x00000000
#define _AUXCON8_CHOPLEN_MASK                    0x00000001
#define _AUXCON8_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPHEN_POSITION                0x00000001
#define _AUXCON8_CHOPHEN_MASK                    0x00000002
#define _AUXCON8_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPSEL_POSITION                0x00000002
#define _AUXCON8_CHOPSEL_MASK                    0x0000003C
#define _AUXCON8_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON8_BLANKSEL_POSITION               0x00000008
#define _AUXCON8_BLANKSEL_MASK                   0x00000F00
#define _AUXCON8_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON8_HRDDIS_POSITION                 0x0000000E
#define _AUXCON8_HRDDIS_MASK                     0x00004000
#define _AUXCON8_HRDDIS_LENGTH                   0x00000001

#define _AUXCON8_HRPDIS_POSITION                 0x0000000F
#define _AUXCON8_HRPDIS_MASK                     0x00008000
#define _AUXCON8_HRPDIS_LENGTH                   0x00000001

#define _AUXCON8_CHOPSEL0_POSITION               0x00000002
#define _AUXCON8_CHOPSEL0_MASK                   0x00000004
#define _AUXCON8_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL1_POSITION               0x00000003
#define _AUXCON8_CHOPSEL1_MASK                   0x00000008
#define _AUXCON8_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL2_POSITION               0x00000004
#define _AUXCON8_CHOPSEL2_MASK                   0x00000010
#define _AUXCON8_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL3_POSITION               0x00000005
#define _AUXCON8_CHOPSEL3_MASK                   0x00000020
#define _AUXCON8_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON8_BLANKSEL0_POSITION              0x00000008
#define _AUXCON8_BLANKSEL0_MASK                  0x00000100
#define _AUXCON8_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL1_POSITION              0x00000009
#define _AUXCON8_BLANKSEL1_MASK                  0x00000200
#define _AUXCON8_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON8_BLANKSEL2_MASK                  0x00000400
#define _AUXCON8_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON8_BLANKSEL3_MASK                  0x00000800
#define _AUXCON8_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON9_IUE_POSITION                    0x00000000
#define _PWMCON9_IUE_MASK                        0x00000001
#define _PWMCON9_IUE_LENGTH                      0x00000001

#define _PWMCON9_XPRES_POSITION                  0x00000001
#define _PWMCON9_XPRES_MASK                      0x00000002
#define _PWMCON9_XPRES_LENGTH                    0x00000001

#define _PWMCON9_CAM_POSITION                    0x00000002
#define _PWMCON9_CAM_MASK                        0x00000004
#define _PWMCON9_CAM_LENGTH                      0x00000001

#define _PWMCON9_MTBS_POSITION                   0x00000003
#define _PWMCON9_MTBS_MASK                       0x00000008
#define _PWMCON9_MTBS_LENGTH                     0x00000001

#define _PWMCON9_DTCP_POSITION                   0x00000005
#define _PWMCON9_DTCP_MASK                       0x00000020
#define _PWMCON9_DTCP_LENGTH                     0x00000001

#define _PWMCON9_DTC_POSITION                    0x00000006
#define _PWMCON9_DTC_MASK                        0x000000C0
#define _PWMCON9_DTC_LENGTH                      0x00000002

#define _PWMCON9_MDCS_POSITION                   0x00000008
#define _PWMCON9_MDCS_MASK                       0x00000100
#define _PWMCON9_MDCS_LENGTH                     0x00000001

#define _PWMCON9_ITB_POSITION                    0x00000009
#define _PWMCON9_ITB_MASK                        0x00000200
#define _PWMCON9_ITB_LENGTH                      0x00000001

#define _PWMCON9_TRGIEN_POSITION                 0x0000000A
#define _PWMCON9_TRGIEN_MASK                     0x00000400
#define _PWMCON9_TRGIEN_LENGTH                   0x00000001

#define _PWMCON9_CLIEN_POSITION                  0x0000000B
#define _PWMCON9_CLIEN_MASK                      0x00000800
#define _PWMCON9_CLIEN_LENGTH                    0x00000001

#define _PWMCON9_FLTIEN_POSITION                 0x0000000C
#define _PWMCON9_FLTIEN_MASK                     0x00001000
#define _PWMCON9_FLTIEN_LENGTH                   0x00000001

